/*
  FilterPresets.strings
  iina

  Created by lhc on 25/8/2017.
  Copyright © 2017 lhc. All rights reserved.
*/
/* It's optional to localize descriptions for each parameter! */



"crop" = "Kadrowanie";
"crop.w" = "Szerokość (domyślnie: szerokość video)";
"crop.h" = "Wysokość (domyślnie: wysokość video)";
"crop.x" = "Początkowe X (domyślnie: środek)";
"crop.y" = "Początkowe Y (domyślnie: środek)";

"expand" = "Rozciągnij";
"expand.w" = "Szerokość (domyślnie: szerokość video)";
"expand.h" = "Wysokość (domyślnie: wysokość video)";
"expand.x" = "Początkowe X (domyślnie: środek)";
"expand.y" = "Początkowe Y (domyślnie: środek)";
"expand.aspect" = "Rozciągnij do proporcji (np.: 4/3)";
"expand.round" = "Zaokrąglenie w górę, aby podzielić przez tę wartość";

"sharpen" = "Wyostrzanie";
"sharpen.msize" = "Rozmiar matrycy";
"sharpen.amount" = "Wartość";

"blur" = "Rozmycie";
"blur.msize" = "Rozmiar matrycy";
"blur.amount" = "Wartość";

"delogo" = "Usunięcie Logo";
"delogo.w" = "Szerokość";
"delogo.h" = "Wysokość";
"delogo.x" = "Początek współrzędnej X";
"delogo.y" = "Początek współrzędnej Y";

"negative" = "Negatyw";

"vflip" = "Odwróć";
"hflip" = "Lustrzane odbicie";

"lut3d" = "3D LUT";
"lut3d.file" = "Ścieżka do pliku (można również przeciągnąć plik w pole wprowadzania)";
"lut3d.interp" = "Tryb interpolacji";

"custom_mpv" = "Własny (mpv)";
"custom_mpv.name" = "Nazwa filtra";
"custom_mpv.string" = "Wartość filtra";

"custom_ffmpeg" = "Własny (Fmpeg)";
"custom_ffmpeg.name" = "Nazwa filtra";
"custom_ffmpeg.string" = "Wartość filtra";
